## Fixing source and sourcetype if needed
[(?::){0}WinEventLog:*]
##TRANSFORMS-Fixup = ta-windows-fix-classic-source,ta-windows-fix-sourcetype


## Fields common to all WinEventLogs
## Splunk Windows TA sourcetype for Windows Event is [WinEventLog]

EXTRACT-00EventID_and_EventCode = (Security-Auditing:|EventIDCode=)(\\t|\s|\\n|)*(?<EventID>(?<EventCode>(?<signature_id>\d+)))(:|\\t|\s|\\n|\n)
EXTRACT-01Error_Code = Error\sCode:(\\t|\s|\\n|)*(?<Error_Code>.*)(\\t|\s|\\n|\n)*
EVAL-Error_Code = if(isnull(Error_Code), "-", Error_Code)
## From Event Header
LOOKUP-CategoryString_for_windows = windows_signature_lookup signature_id OUTPUTNEW CategoryString,action,result
LOOKUP-action_for_windows_xmlsecurity_input = xmlsecurity_eventcode_errorcode_action_lookup EventCode, Error_Code OUTPUTNEW action, action as status, Category as category, Subcategory
##
## The below Windows header data will not always be available whenn forwarding Windows events as syslog
##
FIELDALIAS-dvc_for_windows = host AS dvc_nt_host, ComputerName as dvc
FIELDALIAS-event_id_for_windows = RecordNumber AS event_id
LOOKUP-1severity_for_windows = windows_severity_lookup Type OUTPUTNEW severity
FIELDALIAS-severity_id_for_windows = EventType AS severity_id
FIELDALIAS-id_for_windows = RecordNumber AS id
##
## Default lookup for EventCode->signature mapping ( i.e. EventCode=4625 + SubStaus=null() = "An account failed to log on" )
LOOKUP-signature_for_windows3 = windows_signature_lookup signature_id OUTPUTNEW signature,signature AS name, signature AS subject
##
EVAL-vendor_product = "Microsoft Windows"
##
EXTRACT-Logon_ID_as_session_id = Logon ID:(\\t|\s|\\n|)*(?<session_id>.+?)(\\t|\s|\\n)*(Account Modified:|Account That Was Locked Out:|Additional Information:|Alert Information:|Assigned:|Audit Policy Change:|BackupFileName:|Change Type:|Changes Made:|Changes made:|Class ID:|Computer Account That Was Changed:|Configuration Parameters:|Credential Delegation Information:|Credentials Which Were Replayed:|Cryptographic Parameters:|Cryptographic Provider:|Deleted Group:|Device ID:|Directory Service:|Domain:|Domain Information:|General Settings:|Group:|Interface:|Key Information:|Link Information:|Logon GUID:|Logon Information:|Logon Process Name:|Logon Type:|Member:|Module:|Network Information:|New Account:|New Computer Account:|New Group:|Object:|Ordinal:|Policy For Account:|Privileges:|Process:|Process Information:|Protected Data:|Read Operation:|SPN:|Security Descriptor:|Service:|Service Information:|Session:|Session ID:|Session Name:|Share Information:|Source Handle Information:|Target Account:|Target Computer:|Target Subject:|Task Information:|Transaction Information:|Trust Information:|Trusted Domain:|User:|\n|\\n)
EXTRACT-Client_Logon_ID_as_session_id = Client Logon ID:(\\t|\s|\\n|)*(?<session_id>.+?)(\\t|\s|\\n)*(Accesses:|Privileges:|\n|\\n)
EXTRACT-LogonType_as_Logon_Type = Logon Type:(\\t|\s|\\n|)*(?<Logon_Type>.+?)(\\t|\s|\\n)*(New Logon:|Account For Which Logon Failed:|Impersonation Level:|Restricted Admin mode:|\n|\\n)
EXTRACT-Caller_Logon_ID_as_session_id = Caller Logon ID:(\\t|\s|\\n|)*(?<session_id>.+?)(\\t|\s|\\n)*(Privileges:|\n|\\n)
EXTRACT-Target_Server_Name_as_dest = Target Server Name:(\\t|\s|\\n|)*(\\+)?(?<dest>[^-].*?)(-.*?)?(\\t|\s|\\n)*(Additional Information:|\n|\\n)
EXTRACT-Caller_Domain_as_src_nt_domain = Caller Domain:(\\t|\s|\\n|)*(?<src_nt_domain>(?!^-$).+?)(\\t|\s|\\n)*(Caller Logon ID:|\n|\\n)
EXTRACT-Client_Domain_as_src_nt_domain = Client Domain:(\\t|\s|\\n|)*(?<src_nt_domain>(?!^-$).+?)(\\t|\s|\\n)*(Client Context ID:|Client ID:|Client Logon ID:|\n|\\n)
EXTRACT-Target_Server_Name_as_dest_nt_host = Target Server Name:(\\t|\s|\\n|)*(\\+)?(?<dest_nt_host>[^-].*?)(-.*?)?(\\t|\s|\\n)*(Additional Information:|\n|\\n)
EXTRACT-Group_Domain_as_dest_nt_domain = Group Domain:(\\t|\s|\\n|)*(?<dest_nt_domain>.+?)(\\t|\s|\\n)*(Additional Information:|Attributes:|Changed Attributes:|Process Information:|\n|\\n)
EXTRACT-Primary_Domain_as_dest_nt_domain = Primary Domain:(\\t|\s|\\n|)*(?<dest_nt_domain>.+?)(\\t|\s|\\n)*(Primary Logon ID:|\n|\\n)
EXTRACT-Target_Domain_as_dest_nt_domain = Target Domain:(\\t|\s|\\n|)*(?<dest_nt_domain>.+?)(\\t|\s|\\n)*(Target Account ID:|\n|\\n)
EXTRACT-New_Domain_as_dest_nt_domain = New Domain:(\\t|\s|\\n|)*(?<dest_nt_domain>.+?)(\\t|\s|\\n)*(New Account ID:|\n|\\n)
EXTRACT-Domain_as_dest_nt_domain = Domain:(\\t|\s|\\n|)*(?<dest_nt_domain>.+?)(\\t|\s|\\n)*(Logon ID:|Logon Type:|\n|\\n)
EXTRACT-User_ID_as_dest_nt_domain = User ID:(\\t|\s|\\n|)*(?<dest_nt_domain>.+?)(\\.+?)(\\t|\s|\\n)*(Authentication Policy Information:|Service Information:|Service Name:|\n|\\n)
EXTRACT-Security_ID_as_dest_nt_domain = Security ID:(\\t|\s|\\n|)*(?<dest_nt_domain>.+?)(\\.+?)(\\t|\s|\\n)*(Account Name:|New Flags:|\n|\\n)
EXTRACT-Supplied_Realm_Name_as_dest_nt_domain = Supplied Realm Name:(\\t|\s|\\n|)*(?<dest_nt_domain>.+?)(\\t|\s|\\n)*(Service Information:|Service Name:|User ID:|\n|\\n)
EXTRACT-Target_Account_ID_as_dest_nt_domain = Target Account ID:(\\t|\s|\\n|)*(?<dest_nt_domain>.+?)(\\.+?)(\\t|\s|\\n)*(Caller Machine Name:|Caller User Name:|New Type:|\n|\\n)
EXTRACT-Workstation_Name_as_src = Workstation Name:(\\t|\s|\\n|)*(\\+)?(?<src>.+?)(-.*?)?(\\t|\s|\\n)*(Detailed Authentication Information:|Source Network Address:|\n|\\n)
EXTRACT-Caller_Machine_Name_as_src = Caller Machine Name:(\\t|\s|\\n|)*(\\+)?(?<src>[^-].+?)(-.*?)?(\\t|\s|\\n)*(Caller User Name:|\n|\\n)
EXTRACT-Source_Network_Address_as_src = Source Network Address:(\\t|\s|\\n|)*(\\+)?(?<src>.+?)(-.*?)?(\\t|\s|\\n)*(Source Port:|\n|\\n)
EXTRACT-Client_Address_as_src = Client Address:(\\t|\s|\\n|)*(\\+)?(?<src>.+?)(-.*?)?(\\t|\s|\\n)*(Client Port:|\n|\\n)
EXTRACT-Source_Workstation_as_src = Source Workstation:(\\t|\s|\\n|)*(\\+)?(?<src>.+?)(-.*?)?(\\t|\s|\\n)*(Error Code:|\n|\\n)
EXTRACT-Source_Network_Address_as_src_ip = Source Network Address:(\\t|\s|\\n|)*(\\+)?(?<src_ip>.+?)(-.*?)?(\\t|\s|\\n)*(Source Port:|\n|\\n)
EXTRACT-Client_Address_as_src_ip = Client Address:(\\t|\s|\\n|)*(\\+)?(?<src_ip>.+?)(-.*?)?(\\t|\s|\\n)*(Client Port:|\n|\\n)
EXTRACT-Account_Domain_as_src_nt_domain = Account Domain:(\\t|\s|\\n|)*(?<src_nt_domain>(?!^-$).+?)(\\t|\s|\\n)*(Fully Qualified Account Name:|Logon GUID:|Logon ID:|LogonId:|Service Information:|Trust Information:|\n|\\n)
EXTRACT-Domain_as_src_nt_domain = Domain:(\\t|\s|\\n|)*(?<src_nt_domain>.+?)(\\t|(\\t|\s|\\n)*)(Logon ID:|Logon Type:|\n|\\n)
EXTRACT-New_Security_ID_as_src_nt_domain = (?s)(?:Subject|User|Account\sInformation)(\\t|\s|\\n|)*:.*?Security\sID:(\\t|\s|\\n)*(?<src_nt_domain>.+?)(\\|Account Name:|New Flags:|\n|\\n)
EXTRACT-Security_ID_as_src_nt_domain = Security\sID:(\\t|\s|\\n|)*(?<src_nt_domain>(?!^-$).+?)(\\t|\s|\\n)*(\\|Account Name:|New Flags:|\n|\\n)
EXTRACT-Workstation_Name_as_src_nt_host = Workstation\sName:(\\t|\s|\\n|)*(?:[\\]+)?(?<src_nt_host>[^-].*?)(-.*?)?(\\t|\s|\\n)*(Detailed Authentication Information:|Source Network Address:|\n|\\n)
EXTRACT-Caller_Machine_Name_as_src_nt_host = Caller\sMachine\sName:(\\t|\s|\\n|)*(?:[\\]+)?(?<src_nt_host>[^-].*?)(-.*?)?(\\t|\s|\\n)*(Caller User Name:|\n|\\n)
EXTRACT-Client_Machine_Name_as_src_nt_host = Client\sMachine\sName:(\\t|\s|\\n|)*(?:[\\]+)?(?<src_nt_host>[^-].*?)(-.*?)?(\\t|\s|\\n)*(\n|\\n)
EXTRACT-Caller_Computer_Name_as_src_nt_host = Caller\sComputer\sName:(\\t|\s|\\n|)*(?:[\\]+)?(?<src_nt_host>[^-].*?)(-.*?)?(\\t|\s|\\n)*(\n|\\n)
EXTRACT-Source_Workstation_as_src_nt_host = Source\sWorkstation:(\\t|\s|\\n|)*(?:[\\]+)?(?<src_nt_host>[^-].*?)(-.*?)?(\\t|\s|\\n)*(Error Code:|\n|\\n)
EXTRACT-Caller_User_Name_as_src_user = Caller\sUser\sName:(\\t|\s|\\n|)*(?<src_user>(?!^-$).+?)(\\t|\s|\\n)*(Caller Domain:|\n|\\n)
EXTRACT-Client_User_Name_as_src_user = Client\sUser\sName:(\\t|\s|\\n|)*(?<src_user>(?!^-$).+?)(\\t|\s|\\n)*(Client Domain:|\n|\\n)
EXTRACT-Account_Name_as_src_user = Account\sName:(\\t|\s|\\n|)*(?<src_user>(?!^-$).+?)(\\t|\s|\\n)*(Account Domain:|Account Name:|Process Information:|Service Information:|Supplied Realm Name:|Workstation:|\n|\\n)
EXTRACT-User_Name_as_src_user = Account\sName:(\\t|\s|\\n|)*(?<src_user>.+?)(\\t|\s|\\n)*(Account Domain:|Domain:|Domain Name:|\n|\\n)
EXTRACT-Target_User_Name_as_user = Target\sUser\sName:(\\t|\s|\\n|)*(?<user>.+?)(\\t|\s|\\n)*(Target\sDomain:|\n|\\n)
EXTRACT-Primary_User_Name_as_user = Primary\sUser\sName:(\\t|\s|\\n|)*(?<user>.+?)(\\t|\s|\\n)*(Primary\sDomain:|\n|\\n)
EXTRACT-Target_Account_Name_as_user = Target\sAccount\sName:(\\t|\s|\\n|)*(?<user>.+?)(\\t|\s|\\n)*(Target Account Domain:|Target Domain:|\n|\\n)
EXTRACT-New_Account_Name_as_user = New\sAccount\sName:(\\t|\s|\\n|)*(?<user>.+?)(\\t|\s|\\n)*(Additional Information:|\n|\\n)
EXTRACT-User_Name_as_user = User\sName:(\\t|\s|\\n|)*(?<user>.+?)(\\t|\s|\\n)*(Account Domain:|Domain:|Domain Name:|\n|\\n)
EXTRACT-Account_Name_as_user = Account\sName:(\\t|\s|\\n|)*(?<user>.+?)(\\t|\s|\\n)*(Account Domain:|Account Name:|Process Information:|Service Information:|Supplied Realm Name:|Workstation:|\n|\\n)
EXTRACT-Account_Domain_as_dest_nt_domain = Account Domain:(\\t|\s|\\n|)*(?<dest_nt_domain>.+?)(\\t|\s|\\n)*(Fully Qualified Account Name:|Logon GUID:|Logon ID:|LogonId:|Service Information:|Trust Information:|\n|\\n)
EXTRACT-Logon_Account_as_user = Logon\sAccount:(\\t|\s|\\n|)*((\\){2,4})?(?<user>.+?)(\\t|\s|\\n|)*(Source Workstation:|\\n|\n)
EXTRACT-Security_ID_as_user = Security ID:(\\t|\s|\\n|)*([^\\]+(\\){2,4})?(?<user>.+?)(\\t|\s|\\n)*(Account Name:|New Flags:)
EXTRACT-extract_parent_process_name = Creator\sProcess\sName:(\\t|\s|\\n|)*(.*\\)?(?<parent_process_name>.+?)(\\t|\s|\\n|)*(Process Command Line:|\\n|\n)
EXTRACT-extract_new_process_name = New\sProcess\sName:(\\t|\s|\\n|)*(.*\\)?(?<new_process_name>.+?)(\\t|\s|\\n|)*(Token Elevation Type:)
EXTRACT-extract_target_process_name = Target\sProcess\sName:(\\t|\s|\\n|)*(.*\\)?(?<target_process_name>.+?)(\\t|\s|\\n|)*(New Token Information:|\\n|\n)
EXTRACT-object_name_and_path_from_object_name = Object\sName:(\\t|\s|\\n|)*(?<object_file_path>(.*[\\|\/])?(?<object_file_name>[^-].*?))(\\t|\s|\\n)*(Object Handle:|Auditing Settings:|Handle ID:|New Handle ID:|Object Details:|Object Handle:|Object ID:|Object Properties Modified:|Object Value Name:|Process ID:|Process Information:|Scope Names:)
EXTRACT-process_command_line_process_and_arguments = Process Command Line:(\\t|\s|\\n|)*((?<process_command_line_process>\"[^\"]+\"|[^\s]+)\s*(?<process_command_line_arguments>.*?))(\\t|\s|\\n)*(Token Elevation Type.*)
EXTRACT-file_name_and_path_from_file_name = File\sName:(\\t|\s|\\n|)*(?<file_path>(.*[\\|\/])?(?<file_name>[^-].*?))(\\t|\s|\\n)*(Link Name:|Virtual File Name:|\n|\\n)
EXTRACT-file_name_and_path_from_file_path = File\sPath:(\\t|\s|\\n|)*(?<file_path>(.*[\\|\/])?(?<file_name>[^-].*?))(\\t|\s|\\n)*(Operation:|\n|\\n)
EXTRACT-process_name_for_windows_security = (?<!Creator\s|New\s|Target\s)Process Name:(\\t|\s|\\n|)*(?<process_name>(.*?(?=((\\t|\s|\\n)*Exit Status:))|.*?(?=(\\t|\s|\\n)*Access Request Information:))|.*?(?=(\\t|\s|\\n)*Requested Operation:))
EXTRACT-Token_Elevation_Type_id_for_windows_security = Token\sElevation\sType:(\\t|\s|\\n|)*(?<Token_Elevation_Type_id>.*?)(\\t|\s|\\n)*(Mandatory Label:|\n|\\n)


