
[search]
display.events.fields = ["host","source","sourcetype","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","dest_nt_domain","index","linecount","punct","session_id","splunk_server","src_nt_domain","src_user","timeendpos","timestartpos","user","category","dvc_nt_host","Error_Code","EventCode","EventID","eventtype","name","parent_process_name","process_command_line_arguments","process_command_line_process","process_name","signature","signature_id","Subcategory","subject","tag","tag::eventtype","Token_Elevation_Type_id","vendor_product"]
display.page.search.mode = verbose
